app/views/public_recipes/_public_recipe.html.erb

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" IN ($1, $2, $3)  [["recipe_id", 1], ["recipe_id", 2], ["recipe_id", 4]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1  [["public", true]]
---
  <div class="recipe-items">
    <p>Total food items: <%=public_recipe.recipe_foods.length %>