app/controllers/food_controller.rb

  def create
    @user = current_user
    @food = @user.foods.new(food_params)
    redirect_to user_food_index_path(user_id: current_user.id) if @food.save
---
INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Milk"], ["measurement_unit", "grams"], ["price", 25], ["quantity", 7], ["created_at", "2023-03-09 06:59:22.086360"], ["updated_at", "2023-03-09 06:59:22.086360"], ["user_id", 1]]

  def destroy
    @food = Food.find(params[:id]).destroy
---
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]