app/controllers/general_shopping_list_controller.rb

  def index
    @recipe_foods = @recipe.recipe_foods.includes(:food).order(:id)

    @missing_foods = @recipe_foods.select { |recipe_food| recipe_food.quantity.to_i > recipe_food.food.quantity }
---
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1 ORDER BY "recipe_foods"."id" ASC  [["recipe_id", 1]]

  def set_recipe
    @recipe = set_user.recipes.find(params[:recipe_id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]