app/controllers/recipe_food_controller.rb

INSERT INTO "recipe_foods" ("quantity", "created_at", "updated_at", "recipe_id", "food_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 3], ["created_at", "2023-03-11 04:56:17.247507"], ["updated_at", "2023-03-11 04:56:17.247507"], ["recipe_id", 1], ["food_id", 1]]
---
  def create
    @recipe_food = RecipeFood.new(recipe: @recipe, food: @food, quantity: recipe_food_params[:quantity])
    if @recipe_food.save

UPDATE "recipe_foods" SET "quantity" = $1, "updated_at" = $2 WHERE "recipe_foods"."id" = $3  [["quantity", 2], ["updated_at", "2023-03-11 04:57:33.835998"], ["id", 3]]
---
  def update
    if @recipe_food.update(food: @food, quantity: recipe_food_params[:quantity])

DELETE FROM "recipe_foods" WHERE "recipe_foods"."id" = $1  [["id", 3]]
---
  def destroy
    if @recipe_food.destroy

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1 AND "foods"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def set_food
    @food = set_user.foods.find(recipe_food_params[:food_id])

SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1 AND "recipe_foods"."id" = $2 LIMIT $3  [["recipe_id", 3], ["id", 3], ["LIMIT", 1]]
---
  def set_recipe_food
    @recipe_food = set_recipe.recipe_foods.find(params[:id])

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def set_recipe
    @recipe = set_user.recipes.find(params[:recipe_id])