app/controllers/recipe_foods_controller.rb

    def new
        @foods = Food.all
---
SELECT "foods".* FROM "foods"

    def create
        @recipe = Recipe.find(params[:recipe_id])
        @recipe_food = RecipeFood.new(recipe_id: params[:recipe_id],
                                      quantity:
                                      params.require(:recipe_food).permit(:quantity)[:quantity], food_id:
                                        params.require(:recipe_food).permit(:food_id)[:food_id])

        if @recipe_food.save
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "recipe_foods" ("quantity", "created_at", "updated_at", "recipe_id", "food_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["quantity", 2], ["created_at", "2023-03-10 09:56:36.288514"], ["updated_at", "2023-03-10 09:56:36.288514"], ["recipe_id", 1], ["food_id", 1]]

    def destroy
        @recipe_food = RecipeFood.find(params[:id]).destroy
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recipe_foods" WHERE "recipe_foods"."id" = $1  [["id", 1]]