app/controllers/recipes_controller.rb

  def public_recipes
    @recipes = Recipe.where(public: true)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1  [["public", true]]